tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1947_tdd.h
#define DACR0                         522
#define DACR                          523
#define DACR1                         524
#define DACR2                         525
#define DACR3                         526
#define DACR4                         527
#define SRCON0                        528
#define SRPR                          529
#define SRPS                          530
#define SRNQEN                        531
#define SRQEN                         532
#define SRCLK0                        533
#define SRCLK                         534
#define SRCLK1                        535
#define SRCLK2                        536
#define SRLEN                         537
#define SRCON1                        538
#define SRRC1E                        539
#define SRRC2E                        540
#define SRRCKE                        541
#define SRRPE                         542
#define SRSC1E                        543
#define SRSC2E                        544
#define SRSCKE                        545
#define SRSPE                         546
#define APFCON                        547
#define P1BSEL                        548
#define P1CSEL                        549
#define CCP2SEL                       550
#define P2BSEL                        551
#define P2CSEL                        552
#define P2DSEL                        553
#define P3BSEL                        554
#define P3CSEL                        555
#define CM3CON0                       556
#define C3SYNC                        557
#define C3HYS                         558
#define C3SP                          559
#define C3POL                         560
#define C3OE                          561
#define CM3CON0_C3OUT                 562
#define C3ON                          563
#define CM3CON1                       564
#define C3NCH                         565
#define C3NCH0                        566
#define C3NCH1                        567
#define C3PCH                         568
#define C3PCH0                        569
#define C3PCH1                        570
#define C3INTN                        571
#define C3INTP                        572
#define ANSA0                         573
#define ANSELA                        574
#define ANSA1                         575
#define ANSA2                         576
#define ANSA3                         577
#define ANSA5                         578
#define ANSELE                        579
#define ANSE0                         580
#define ANSE1                         581
#define ANSE2                         582
#define EEADRL                        583
#define EEADRH                        584
#define EEDATL                        585
#define EEDATH                        586
#define EECON1                        587
#define RD                            588
#define WR                            589
#define WREN                          590
#define WRERR                         591
#define FREE                          592
#define LWLO                          593
#define CFGS                          594
#define EEPGD                         595
#define EECON2                        596
#define RC1REG                        597
#define RC1REG_RCREG                  598
#define TX1REG                        599
#define TX1REG_TXREG                  600
#define SP1BRGL                       601
#define SP1BRGL_SPBRGL                602
#define SP1BRGH                       603
#define SP1BRGH_SPBRGH                604
#define RC1STA                        605
#define RC1STA_RX9D                   606
#define RC1STA_OERR                   607
#define RC1STA_FERR                   608
#define RC1STA_ADDEN                  609
#define RC1STA_CREN                   610
#define RC1STA_SREN                   611
#define RC1STA_RX9                    612
#define RC1STA_SPEN                   613
#define TX1STA                        614
#define TX1STA_TX9D                   615
#define TX1STA_TRMT                   616
#define TX1STA_BRGH                   617
#define TX1STA_SENDB                  618
#define TX1STA_SYNC                   619
#define TX1STA_TXEN                   620
#define TX1STA_TX9                    621
#define TX1STA_CSRC                   622
#define BAUD1CON                      623
#define BAUD1CON_ABDEN                624
#define BAUD1CON_WUE                  625
#define BAUD1CON_BRG16                626
#define BAUD1CON_SCKP                 627
#define BAUD1CON_RCIDL                628
#define BAUD1CON_ABDOVF               629
#define WPUB0                         630
#define WPUB                          631
#define WPUB1                         632
#define WPUB2                         633
#define WPUB3                         634
#define WPUB4                         635
#define WPUB5                         636
#define WPUB6                         637
#define WPUB7                         638
#define SSP1BUF                       639
#define SSP1BUF_SSPBUF                640
#define SSP1ADD                       641
#define SSP1ADD_SSPADD                642
#define SSP1MSK                       643
#define SSP1MSK_SSPMSK                644
#define SSP1STAT                      645
#define SSP1STAT_BF                   646
#define SSP1STAT_UA                   647
#define SSP1STAT_R_nW                 648
#define SSP1STAT_S                    649
#define SSP1STAT_P                    650
#define SSP1STAT_D_nA                 651
#define SSP1STAT_CKE                  652
#define SSP1STAT_SMP                  653
#define SSP1CON1                      654
#define SSP1CON1_SSPM0                655
#define SSP1CON1_SSPM1                656
#define SSP1CON1_SSPM2                657
#define SSP1CON1_SSPM3                658
#define SSP1CON1_CKP                  659
#define SSP1CON1_SSPEN                660
#define SSP1CON1_SSPOV                661
#define SSP1CON1_WCOL                 662
#define SSP1CON2                      663
#define SSP1CON2_SEN                  664
#define SSP1CON2_RSEN                 665
#define SSP1CON2_PEN                  666
#define SSP1CON2_RCEN                 667
#define SSP1CON2_ACKEN                668
#define SSP1CON2_ACKDT                669
#define SSP1CON2_ACKSTAT              670
#define SSP1CON2_GCEN                 671
#define SSP1CON3                      672
#define SSP1CON3_DHEN                 673
#define SSP1CON3_AHEN                 674
#define SSP1CON3_SBCDE                675
#define SSP1CON3_SDAHT                676
#define SSP1CON3_BOEN                 677
#define SSP1CON3_SCIE                 678
#define SSP1CON3_PCIE                 679
#define SSP1CON3_ACKTIM               680
#define SSP2BUF                       681
#define SSP2BUF_SSPBUF                682
#define SSP2ADD                       683
#define SSP2ADD_SSPADD                684
#define SSP2MSK                       685
#define SSP2MSK_SSPMSK                686
#define SSP2STAT                      687
#define SSP2STAT_BF                   688
#define SSP2STAT_UA                   689
#define SSP2STAT_R_nW                 690
#define SSP2STAT_S                    691
#define SSP2STAT_P                    692
#define SSP2STAT_D_nA                 693
#define SSP2STAT_CKE                  694
#define SSP2STAT_SMP                  695
#define SSP2CON1                      696
#define SSP2CON1_SSPM0                697
#define SSP2CON1_SSPM1                698
#define SSP2CON1_SSPM2                699
#define SSP2CON1_SSPM3                700
#define SSP2CON1_CKP                  701
#define SSP2CON1_SSPEN                702
#define SSP2CON1_SSPOV                703
#define SSP2CON1_WCOL                 704
#define SSP2CON2                      705
#define SSP2CON2_SEN                  706
#define SSP2CON2_RSEN                 707
#define SSP2CON2_PEN                  708
#define SSP2CON2_RCEN                 709
#define SSP2CON2_ACKEN                710
#define SSP2CON2_ACKDT                711
#define SSP2CON2_ACKSTAT              712
#define SSP2CON2_GCEN                 713
#define SSP2CON3                      714
#define SSP2CON3_DHEN                 715
#define SSP2CON3_AHEN                 716
#define SSP2CON3_SBCDE                717
#define SSP2CON3_SDAHT                718
#define SSP2CON3_BOEN                 719
#define SSP2CON3_SCIE                 720
#define SSP2CON3_PCIE                 721
#define SSP2CON3_ACKTIM               722
#define PORTF                         723
#define CPS16                         724
#define RF0                           725
#define SEG41                         726
#define C2IN0N                        727
#define C1IN0N                        728
#define AN16                          729
#define SEG19                         730
#define AN6                           731
#define PORTF_C2OUT                   732
#define RF1                           733
#define SRNQ                          734
#define CPS6                          735
#define AN7                           736
#define RF2                           737
#define PORTF_C1OUT                   738
#define SEG20                         739
#define SRQ                           740
#define CPS7                          741
#define AN8                           742
#define RF3                           743
#define SEG21                         744
#define C3IN2N                        745
#define C2IN2N                        746
#define C1IN2N                        747
#define CPS8                          748
#define AN9                           749
#define RF4                           750
#define SEG22                         751
#define C2INP                         752
#define CPS9                          753
#define C2IN1N                        754
#define CPS10                         755
#define RF5                           756
#define C1IN1N                        757
#define SEG23                         758
#define DACOUT                        759
#define AN10                          760
#define C1INP                         761
#define CPS11                         762
#define RF6                           763
#define SEG24                         764
#define AN11                          765
#define C2IN3N                        766
#define C3IN3N                        767
#define AN5                           768
#define C1IN3N                        769
#define RF7                           770
#define SEG25                         771
#define CPS5                          772
#define PORTG                         773
#define CCP3                          774
#define SEG42                         775
#define P3A                           776
#define RG0                           777
#define CPS15                         778
#define SEG43                         779
#define AN15                          780
#define PORTG_C3OUT                   781
#define TX2                           782
#define RG1                           783
#define CK2                           784
#define CPS14                         785
#define C3INP                         786
#define SEG44                         787
#define RX2                           788
#define RG2                           789
#define AN14                          790
#define DT2                           791
#define CPS13                         792
#define CCP4                          793
#define SEG45                         794
#define C3IN0N                        795
#define P3D                           796
#define RG3                           797
#define AN13                          798
#define C3IN1N                        799
#define CPS12                         800
#define CCP5                          801
#define SEG26                         802
#define P1D                           803
#define RG4                           804
#define AN12                          805
#define RG5                           806
#define nMCLR                         807
#define CCPR1L                        808
#define CCPR1H                        809
#define CCP1CON                       810
#define CCP1M0                        811
#define CCP1M                         812
#define CCP1M1                        813
#define CCP1M2                        814
#define CCP1M3                        815
#define DC1B                          816
#define DC1B0                         817
#define DC1B1                         818
#define P1M                           819
#define P1M0                          820
#define P1M1                          821
#define PWM1CON                       822
#define P1DC0                         823
#define P1DC1                         824
#define P1DC2                         825
#define P1DC3                         826
#define P1DC4                         827
#define P1DC5                         828
#define P1DC6                         829
#define P1RSEN                        830
#define CCP1AS                        831
#define PSS1BD0                       832
#define PSS1BD1                       833
#define PSS1AC0                       834
#define PSS1AC1                       835
#define CCP1AS0                       836
#define CCP1AS1                       837
#define CCP1AS2                       838
#define CCP1ASE                       839
#define PSTR1CON                      840
#define STR1A                         841
#define STR1B                         842
#define STR1C                         843
#define STR1D                         844
#define STR1SYNC                      845
#define CCPR2L                        846
#define CCPR2H                        847
#define CCP2CON                       848
#define CCP2M                         849
#define CCP2M0                        850
#define CCP2M1                        851
#define CCP2M2                        852
#define CCP2M3                        853
#define DC2B                          854
#define DC2B0                         855
#define DC2B1                         856
#define P2M                           857
#define P2M0                          858
#define P2M1                          859
#define PWM2CON                       860
#define P2DC0                         861
#define P2DC1                         862
#define P2DC2                         863
#define P2DC3                         864
#define P2DC4                         865
#define P2DC5                         866
#define P2DC6                         867
#define P2RSEN                        868
#define CCP2AS                        869
#define PSS2BD0                       870
#define PSS2BD1                       871
#define PSS2AC0                       872
#define PSS2AC1                       873
#define CCP2AS0                       874
#define CCP2AS1                       875
#define CCP2AS2                       876
#define CCP2ASE                       877
#define PSTR2CON                      878
#define STR2A                         879
#define STR2B                         880
#define STR2C                         881
#define STR2D                         882
#define STR2SYNC                      883
#define CCPTMRS0                      884
#define C1TSEL0                       885
#define C1TSEL                        886
#define C1TSEL1                       887
#define C2TSEL0                       888
#define C2TSEL                        889
#define C2TSEL1                       890
#define C3TSEL0                       891
#define C3TSEL                        892
#define C3TSEL1                       893
#define C4TSEL                        894
#define C4TSEL0                       895
#define C4TSEL1                       896
#define CCPTMRS1                      897
#define C5TSEL                        898
#define C5TSEL0                       899
#define C5TSEL1                       900
#define TRISF                         901
#define TRISF0                        902
#define TRISF1                        903
#define TRISF2                        904
#define TRISF3                        905
#define TRISF4                        906
#define TRISF5                        907
#define TRISF6                        908
#define TRISF7                        909
#define TRISG                         910
#define TRISG0                        911
#define TRISG1                        912
#define TRISG2                        913
#define TRISG3                        914
#define TRISG4                        915
#define TRISG5                        916
#define CCPR3L                        917
#define CCPR3H                        918
#define CCP3CON                       919
#define CCP3M0                        920
#define CCP3M1                        921
#define CCP3M2                        922
#define CCP3M3                        923
#define DC3B0                         924
#define DC3B1                         925
#define P3M0                          926
#define P3M1                          927
#define PWM3CON                       928
#define P3DC0                         929
#define P3DC1                         930
#define P3DC2                         931
#define P3DC3                         932
#define P3DC4                         933
#define P3DC5                         934
#define P3DC6                         935
#define P3RSEN                        936
#define CCP3AS                        937
#define PSS3BD0                       938
#define PSS3BD1                       939
#define PSS3AC0                       940
#define PSS3AC1                       941
#define CCP3AS0                       942
#define CCP3AS1                       943
#define CCP3AS2                       944
#define CCP3ASE                       945
#define PSTR3CON                      946
#define STR3A                         947
#define STR3B                         948
#define STR3C                         949
#define STR3D                         950
#define STR3SYNC                      951
#define CCPR4L                        952
#define CCPR4H                        953
#define CCP4CON                       954
#define CCP4M0                        955
#define CCP4M1                        956
#define CCP4M2                        957
#define CCP4M3                        958
#define DC4B0                         959
#define DC4B1                         960
#define CCPR5L                        961
#define CCPR5H                        962
#define CCP5CON                       963
#define CCP5M0                        964
#define CCP5M1                        965
#define CCP5M2                        966
#define CCP5M3                        967
#define DC5B0                         968
#define DC5B1                         969
#define LATF                          970
#define LATF0                         971
#define LATF1                         972
#define LATF2                         973
#define LATF3                         974
#define LATF4                         975
#define LATF5                         976
#define LATF6                         977
#define LATF7                         978
#define LATG                          979
#define LATG0                         980
#define LATG1                         981
#define LATG2                         982
#define LATG3                         983
#define LATG4                         984
#define LATG5                         985
#define IOCBP                         986
#define IOCBP0                        987
#define IOCBP1                        988
#define IOCBP2                        989
#define IOCBP3                        990
#define IOCBP4                        991
#define IOCBP5                        992
#define IOCBP6                        993
#define IOCBP7                        994
#define IOCBN0                        995
#define IOCBN                         996
#define IOCBN1                        997
#define IOCBN2                        998
#define IOCBN3                        999
#define IOCBN4                        1000
#define IOCBN5                        1001
#define IOCBN6                        1002
#define IOCBN7                        1003
#define IOCBF0                        1004
#define IOCBF                         1005
#define IOCBF1                        1006
#define IOCBF2                        1007
#define IOCBF3                        1008
#define IOCBF4                        1009
#define IOCBF5                        1010
#define IOCBF6                        1011
#define IOCBF7                        1012
#define ANSELF                        1013
#define ANSF0                         1014
#define ANSF1                         1015
#define ANSF2                         1016
#define ANSF3                         1017
#define ANSF4                         1018
#define ANSF5                         1019
#define ANSF6                         1020
#define ANSF7                         1021
#define ANSELG                        1022
#define ANSG1                         1023
#define ANSG2                         1024
#define ANSG3                         1025
#define ANSG4                         1026
#define TMR4                          1027
#define PR4                           1028
#define T4CON                         1029
#define T4CKPS0                       1030
#define T4CKPS                        1031
#define T4CKPS1                       1032
#define TMR4ON                        1033
#define T4OUTPS                       1034
#define T4OUTPS0                      1035
#define T4OUTPS1                      1036
#define T4OUTPS2                      1037
#define T4OUTPS3                      1038
#define TMR6                          1039
#define PR6                           1040
#define T6CON                         1041
#define T6CKPS0                       1042
#define T6CKPS                        1043
#define T6CKPS1                       1044
#define TMR6ON                        1045
#define T6OUTPS0                      1046
#define T6OUTPS                       1047
#define T6OUTPS1                      1048
#define T6OUTPS2                      1049
#define T6OUTPS3                      1050
#define WPUG                          1051
#define WPUG5                         1052
#define RC2REG                        1053
#define RC2REG_RCREG                  1054
#define TX2REG                        1055
#define TX2REG_TXREG                  1056
#define SP2BRGL                       1057
#define SP2BRGL_SPBRGL                1058
#define SP2BRGH                       1059
#define SP2BRGH_SPBRGH                1060
#define RC2STA                        1061
#define RC2STA_RX9D                   1062
#define RC2STA_OERR                   1063
#define RC2STA_FERR                   1064
#define RC2STA_ADDEN                  1065
#define RC2STA_CREN                   1066
#define RC2STA_SREN                   1067
#define RC2STA_RX9                    1068
#define RC2STA_SPEN                   1069
#define TX2STA                        1070
#define TX2STA_TX9D                   1071
#define TX2STA_TRMT                   1072
#define TX2STA_BRGH                   1073
#define TX2STA_SENDB                  1074
#define TX2STA_SYNC                   1075
#define TX2STA_TXEN                   1076
#define TX2STA_TX9                    1077
#define TX2STA_CSRC                   1078
#define BAUD2CON                      1079
#define BAUD2CON_ABDEN                1080
#define BAUD2CON_WUE                  1081
#define BAUD2CON_BRG16                1082
#define BAUD2CON_SCKP                 1083
#define BAUD2CON_RCIDL                1084
#define BAUD2CON_ABDOVF               1085
#define LCDCON                        1086
#define LMUX0                         1087
#define LMUX                          1088
#define LMUX1                         1089
#define CS                            1090
